#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with aws_s3_bucket.terraform_state,
[33m│[0m [0m  on s3.tf line 1, in resource "aws_s3_bucket" "terraform_state":
[33m│[0m [0m   1: resource "aws_s3_bucket" "terraform_state" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse the aws_s3_bucket_versioning resource instead
[33m│[0m [0m
[33m│[0m [0m(and one more similar warning elsewhere)
[33m╵[0m[0m
[32m[1mSuccess![0m The configuration is valid, but there were some
validation warnings as shown above.
[0m

```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[1maws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-state-locking][0m
[0m[1maws_s3_bucket.terraform_state: Refreshing state... [id=terraform-state-caiomoretti][0m
[0m[1maws_vpc.my-library-vpc: Refreshing state... [id=vpc-0eb8a550a758a6d33][0m
[0m[1maws_internet_gateway.my-library-igw: Refreshing state... [id=igw-09f58cb5aa95b9a06][0m
[0m[1maws_subnet.my-library-subnet: Refreshing state... [id=subnet-0c550e9409f1fe55c][0m
[0m[1maws_security_group.enable-ssh-sg: Refreshing state... [id=sg-013fa12de75f01492][0m
[0m[1maws_route_table.my-library-route-table: Refreshing state... [id=rtb-0351d9ad13f79a7ef][0m
[0m[1maws_route_table_association.my-library-subnet-association: Refreshing state... [id=rtbassoc-08670227ab05eeba1][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m

Terraform will perform the following actions:

[1m  # aws_instance.my-library-ec2[0m will be created
[0m  [32m+[0m[0m resource "aws_instance" "my-library-ec2" {
      [32m+[0m[0m ami                                  = "ami-03f65b8614a860c29"
      [32m+[0m[0m arn                                  = (known after apply)
      [32m+[0m[0m associate_public_ip_address          = true
      [32m+[0m[0m availability_zone                    = (known after apply)
      [32m+[0m[0m cpu_core_count                       = (known after apply)
      [32m+[0m[0m cpu_threads_per_core                 = (known after apply)
      [32m+[0m[0m disable_api_stop                     = (known after apply)
      [32m+[0m[0m disable_api_termination              = (known after apply)
      [32m+[0m[0m ebs_optimized                        = (known after apply)
      [32m+[0m[0m get_password_data                    = false
      [32m+[0m[0m host_id                              = (known after apply)
      [32m+[0m[0m host_resource_group_arn              = (known after apply)
      [32m+[0m[0m iam_instance_profile                 = (known after apply)
      [32m+[0m[0m id                                   = (known after apply)
      [32m+[0m[0m instance_initiated_shutdown_behavior = (known after apply)
      [32m+[0m[0m instance_lifecycle                   = (known after apply)
      [32m+[0m[0m instance_state                       = (known after apply)
      [32m+[0m[0m instance_type                        = "t2.micro"
      [32m+[0m[0m ipv6_address_count                   = (known after apply)
      [32m+[0m[0m ipv6_addresses                       = (known after apply)
      [32m+[0m[0m key_name                             = "ec2-public-key"
      [32m+[0m[0m monitoring                           = true
      [32m+[0m[0m outpost_arn                          = (known after apply)
      [32m+[0m[0m password_data                        = (known after apply)
      [32m+[0m[0m placement_group                      = (known after apply)
      [32m+[0m[0m placement_partition_number           = (known after apply)
      [32m+[0m[0m primary_network_interface_id         = (known after apply)
      [32m+[0m[0m private_dns                          = (known after apply)
      [32m+[0m[0m private_ip                           = (known after apply)
      [32m+[0m[0m public_dns                           = (known after apply)
      [32m+[0m[0m public_ip                            = (known after apply)
      [32m+[0m[0m secondary_private_ips                = (known after apply)
      [32m+[0m[0m security_groups                      = (known after apply)
      [32m+[0m[0m source_dest_check                    = true
      [32m+[0m[0m spot_instance_request_id             = (known after apply)
      [32m+[0m[0m subnet_id                            = "subnet-0c550e9409f1fe55c"
      [32m+[0m[0m tags                                 = {
          [32m+[0m[0m "Name" = "My-Library EC2 Instance from Terraform (after unlock)"
        }
      [32m+[0m[0m tags_all                             = {
          [32m+[0m[0m "Name" = "My-Library EC2 Instance from Terraform (after unlock)"
        }
      [32m+[0m[0m tenancy                              = (known after apply)
      [32m+[0m[0m user_data                            = (known after apply)
      [32m+[0m[0m user_data_base64                     = (known after apply)
      [32m+[0m[0m user_data_replace_on_change          = false
      [32m+[0m[0m vpc_security_group_ids               = [
          [32m+[0m[0m "sg-013fa12de75f01492",
        ]
    }

[1mPlan:[0m 1 to add, 0 to change, 0 to destroy.
[0m[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with aws_s3_bucket.terraform_state,
[33m│[0m [0m  on s3.tf line 1, in resource "aws_s3_bucket" "terraform_state":
[33m│[0m [0m   1: resource "aws_s3_bucket" "terraform_state" [4m{[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse the aws_s3_bucket_versioning resource instead
[33m│[0m [0m
[33m│[0m [0m(and 3 more similar warnings elsewhere)
[33m╵[0m[0m
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Caio-Moretti, Action: `pull_request`, Working Directory: ``, Workflow: `Create terraform plan`*